# NoEligibleElementsInAssembly Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..NoEligibleElementsInAssembly Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
No eligible elements in assembly.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoEligibleElementsInAssembly { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoEligibleElementsInAssembly As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoEligibleElementsInAssembly {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace